## Import the SQL database into Pandas.

In [71]:
import pandas as pd
from sqlalchemy import create_engine
import os
from db_connection import user,ps,host,port

In [72]:
 # variables to populate the database connection string
db_user = user
db_password = ps
db_host = host
db_port = port

# This database must already exist
db_name = "employee_db"

In [73]:
#Create engine to connect to the DB
engine = create_engine(f"postgres://{db_user}:{db_password}@{db_host}:{db_port}/{db_name}")

## Create a histogram to visualize the most common salary ranges for employees.

In [75]:
salary = pd.read_sql_table("Salaries",engine)
salary.head()

   emp_no   salary   from_date     to_date
0   10001  60117.0  1986-06-26  1987-06-26
1   10002  65828.0  1996-08-03  1997-08-03
2   10003  40006.0  1995-12-03  1996-12-02
3   10004  40054.0  1986-12-01  1987-12-01
4   10005  78228.0  1989-09-12  1990-09-12

In [76]:
max_sal = salary["salary"].max()
max_sal

129492.0

In [77]:
min_sal = salary["salary"].min()
min_sal

40000.0

In [ ]:
#create a bin

## Create a bar chart of average salary by title.

In [49]:
query = '''
SELECT t.title,s.salary
FROM "Employees" AS e
INNER JOIN "Salaries" AS s
ON s.emp_no = e.emp_no
INNER JOIN "Titles" AS t
ON t.emp_no = s.emp_no;
'''

title_salary = pd.read_sql_query(query,engine)
title_salary.head()

          title   salary
0  Senior Staff  78228.0
1         Staff  78228.0
2      Engineer  72488.0
3         Staff  42365.0
4      Engineer  55881.0

In [55]:
group_sal = title_salary.groupby(title_salary["title"])
avg_salary = group_sal["salary"].mean()
avg_salary

title
Assistant Engineer    48493.204786
Engineer              48539.781423
Manager               51531.041667
Senior Engineer       48506.751806
Senior Staff          58503.286614
Staff                 58465.271904
Technique Leader      48580.505772
Name: salary, dtype: float64

In [64]:
average_salary_df = pd.DataFrame({'avg salary': avg_salary})
average_salary_df.head()

                      avg salary
title
Assistant Engineer  48493.204786
Engineer            48539.781423
Manager             51531.041667
Senior Engineer     48506.751806
Senior Staff        58503.286614

### Evidence in hand, you march into your boss's office and present the visualization. With a sly grin, your boss thanks you for your work. On your way out of the office, you hear the words, "Search your ID number." You look down at your badge to see that your employee ID number is 499942.

In [65]:
emp_query = '''
SELECT * FROM "Employees"
WHERE emp_no = '499942';
'''

title_salary = pd.read_sql_query(emp_query,engine)
title_salary

   emp_no  birth_date first_name last_name gender   hire_date
0  499942  1963-01-10      April  Foolsday      F  1997-02-10